In [2]:
import pandas as pd
import numpy as np

In [3]:
data=pd.read_excel('6-weather.xlsx')

In [4]:
data

   Istanbul  New York  Amsterdam  Paris
0      20.0      10.0       15.0   12.0
1      21.0       NaN       17.0    NaN
2      20.0      13.0        NaN   15.0
3      22.0      14.0       19.0    NaN
4       NaN       NaN       15.0   20.0
5      28.0      13.0       22.0   16.0
6      15.0      12.0        NaN   15.0
7       NaN      15.0       14.0   14.0
8      22.0      16.0       16.0    NaN

In [5]:
data.isna().sum()

Istanbul     2
New York     2
Amsterdam    2
Paris        3
dtype: int64

In [6]:
data.dropna()#eksik veri olan satırları atar

   Istanbul  New York  Amsterdam  Paris
0      20.0      10.0       15.0   12.0
5      28.0      13.0       22.0   16.0

In [ ]:
data.fillna(data.mean())#her kolona kendi ortlamasını koyar

In [ ]:
#GROUP BY

In [11]:
data=pd.read_csv('6-employee.csv')

In [12]:
data.head()

  Department Employee  Salary  Experience           City
0  Marketing    Emp_1   53483           1       New York
1      Sales    Emp_2   78555           8         Austin
2    Finance    Emp_3   47159           3         Austin
3      Sales    Emp_4  110077           3  San Francisco
4      Sales    Emp_5   65920           1       New York

In [13]:
data.describe()

              Salary  Experience
count      50.000000   50.000000
mean    78344.500000    7.060000
std     27817.603904    3.966235
min     31016.000000    1.000000
25%     53687.250000    3.000000
50%     78769.500000    7.000000
75%    100778.000000   10.000000
max    119812.000000   14.000000

In [16]:
data[data['Experience']>11] #eğer data tamamen gelsin istiyorsak parantez içinde tekrar belirtmeliyiz

   Department Employee  Salary  Experience           City
11    Finance   Emp_12  108953          12         Austin
15         IT   Emp_16   75758          12        Chicago
20         IT   Emp_21   62606          14  San Francisco
24         HR   Emp_25  119789          12       New York
32  Marketing   Emp_33  116807          14  San Francisco
38         HR   Emp_39   68044          14       New York
44         IT   Emp_45   92592          12        Chicago
45         HR   Emp_46   97563          13  San Francisco

In [17]:
data[data['Experience']>11].count() #tecrübesi 6 yıldan fazla kaç kişi var

Department    8
Employee      8
Salary        8
Experience    8
City          8
dtype: int64

In [18]:
data_grouped=data.groupby('Department')

In [23]:
data_grouped.describe() #bu artık bir gruplandırışmış veri objesi

           Salary                                                          \
            count          mean           std      min       25%      50%
Department
Finance      10.0  90552.700000  27228.231832  47159.0  73222.00  96591.5
HR            7.0  76182.571429  31647.523983  31016.0  55114.50  78984.0
IT           10.0  63381.600000  24272.881041  32568.0  39755.25  66681.5
Marketing    13.0  79555.000000  28431.207129  39268.0  54300.00  70774.0
Sales        10.0  81038.900000  26623.181534  38571.0  68987.50  80775.0

                                Experience                                \
                  75%       max      count      mean       std  min  25%
Department
Finance     111836.75  119812.0       10.0  6.500000  3.566822  1.0  3.5
HR           96630.00  119789.0        7.0  8.714286  4.572173  3.0  5.0
IT           79850.00   97121.0       10.0  9.000000  4.163332  1.0  7.5
Marketing   104065.00  117538.0       13.0  6.153846  4.079341  1.0  3.0
Sales       100047.50  116779.0       10.0  5.700000  3.093003  1.0  3.5


             50%    75%   max
Department
Finance      6.5   9.50  12.0
HR           9.0  12.50  14.0
IT          10.5  11.75  14.0
Marketing    5.0   9.00  14.0
Sales        7.0   7.75  10.0

In [24]:
data_grouped['Salary'].describe()

,count,mean,std,min,25%,50%,75%,max
Department,,,,,,,,
Finance,10.0,90552.700000,27228.231832,47159.0,73222.00,96591.5,111836.75,119812.0
HR,7.0,76182.571429,31647.523983,31016.0,55114.50,78984.0,96630.00,119789.0
IT,10.0,63381.600000,24272.881041,32568.0,39755.25,66681.5,79850.00,97121.0
Marketing,13.0,79555.000000,28431.207129,39268.0,54300.00,70774.0,104065.00,117538.0
Sales,10.0,81038.900000,26623.181534,38571.0,68987.50,80775.0,100047.50,116779.0

In [25]:
data_cıty=data.groupby('City')

In [26]:
data_cıty.describe()

              Salary                                                         \
               count          mean           std      min      25%      50%
City
Austin          13.0  81216.000000  27010.770975  38571.0  54300.0  78555.0
Chicago         11.0  76869.363636  23718.116389  39692.0  59278.0  81214.0
New York        15.0  70484.133333  33208.693076  31016.0  38396.0  68044.0
San Francisco   11.0  87144.727273  24874.543739  39268.0  68731.0  91228.0

                                  Experience                                \
                    75%       max      count      mean       std  min  25%
City
Austin         104065.0  119812.0       13.0  6.000000  3.582364  1.0  3.0
Chicago         96839.0  102409.0       11.0  7.909091  3.477198  2.0  6.0
New York        95092.0  119789.0       15.0  6.800000  4.296178  1.0  3.0
San Francisco  105644.0  116807.0       11.0  7.818182  4.556713  1.0  5.0


               50%   75%   max
City
Austin         7.0   8.0  12.0
Chicago        8.0  10.5  12.0
New York       8.0  10.0  14.0
San Francisco  7.0  12.0  14.0